src/Enums/ВариантыСтандартногоПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыСтандартногоПериода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭтаНеделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СледующаяНеделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезДвеНедели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезТриНедели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтотМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СледующийМесяц</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВариантыСтандартногоПериода/Ext/ManagerModule.bsl
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Получить стандартный период по значению
//
// Параметры:
//  ВариантСтандартногоПериода	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтандартныйПериодПоЗначению(ВариантСтандартногоПериодаСсылка) Экспорт
	
	Если ВариантСтандартногоПериодаСсылка = Неопределено Тогда 
		Возврат Новый СтандартныйПериод();
	КонецЕсли;
	
	Если ТипЗнч(ВариантСтандартногоПериодаСсылка) = Тип("ПеречислениеСсылка.ВариантыСтандартногоПериода") Тогда 
		Если ВариантСтандартногоПериодаСсылка = ЭтаНеделя Тогда 
			Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтаНеделя);	
		ИначеЕсли ВариантСтандартногоПериодаСсылка = СледующаяНеделя Тогда 
			Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.СледующаяНеделя);
		ИначеЕсли ВариантСтандартногоПериодаСсылка = ЧерезДвеНедели Тогда
			ПериодСледующаяНеделя 					= Новый СтандартныйПериод(ВариантСтандартногоПериода.СледующаяНеделя);
			ПериодЧерезДвеНедели 					= Новый СтандартныйПериод(ВариантСтандартногоПериода.ПроизвольныйПериод);
			ПериодЧерезДвеНедели.ДатаНачала 		= НачалоНедели(ПериодСледующаяНеделя.ДатаОкончания + 1);
			ПериодЧерезДвеНедели.ДатаОкончания 		= КонецНедели(ПериодЧерезДвеНедели.ДатаНачала);
			Возврат ПериодЧерезДвеНедели;			
		ИначеЕсли ВариантСтандартногоПериодаСсылка = ЧерезТриНедели Тогда
			ПериодСледующаяНеделя 					= Новый СтандартныйПериод(ВариантСтандартногоПериода.СледующаяНеделя);
			ПериодЧерезТриНедели 					= Новый СтандартныйПериод(ВариантСтандартногоПериода.ПроизвольныйПериод);
			ПериодЧерезТриНедели.ДатаНачала 		= НачалоНедели(ПериодСледующаяНеделя.ДатаОкончания + (7*24*60*60) + 1);
			ПериодЧерезТриНедели.ДатаОкончания 		= КонецНедели(ПериодЧерезТриНедели.ДатаНачала);
			Возврат ПериодЧерезТриНедели;
		ИначеЕсли ВариантСтандартногоПериодаСсылка = ЭтотМесяц Тогда 
			Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц);	
		ИначеЕсли ВариантСтандартногоПериодаСсылка = СледующийМесяц Тогда 
			Возврат Новый СтандартныйПериод(ВариантСтандартногоПериода.СледующийМесяц);
		Иначе 
			Возврат Новый СтандартныйПериод();
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ВариантСтандартногоПериодаСсылка) = Тип("ВариантСтандартногоПериода") Тогда 
		Возврат Новый СтандартныйПериод(ВариантСтандартногоПериодаСсылка);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция - Сформировать представление варианта стандартного периода
//
// Параметры:
//  ВариантСтандартногоПериодаСсылка - 	 - 
//  СтандартныйПериодОтбора			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьПредставлениеВариантаСтандартногоПериода(ВариантСтандартногоПериодаСсылка, СтандартныйПериодОтбора = Неопределено) Экспорт
	
	ПредставлениеВарианта = Строка(ВариантСтандартногоПериодаСсылка);
	Если НЕ ЗначениеЗаполнено(СтандартныйПериодОтбора) Тогда 
		СтандартныйПериодОтбора = ПолучитьСтандартныйПериодПоЗначению(ВариантСтандартногоПериодаСсылка);
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(СтандартныйПериодОтбора) Тогда 
		Возврат ПредставлениеВарианта;
	КонецЕсли;	
	
	ПредставлениеДатыНачала = Формат(СтандартныйПериодОтбора.ДатаНачала, "ДФ=d");
	Если Месяц(СтандартныйПериодОтбора.ДатаНачала) <> Месяц(СтандартныйПериодОтбора.ДатаОкончания) Тогда
		НаименованиеМесяца = "";
		МассивВариантовСклонения = ПолучитьСклоненияСтроки(Формат(СтандартныйПериодОтбора.ДатаНачала, "ДФ=MMM"), "ПЛ=Мужской", "ПД=Родительный");
		Если МассивВариантовСклонения.Количество() > 0 Тогда 
			НаименованиеМесяца = МассивВариантовСклонения[0];	
		КонецЕсли;
		ПредставлениеДатыНачала = ПредставлениеДатыНачала + ?(ЗначениеЗаполнено(НаименованиеМесяца), " " + НаименованиеМесяца, "");
	КонецЕсли;
	
	ПредставлениеДатыОкончания = Формат(СтандартныйПериодОтбора.ДатаОкончания, "ДФ=d");
	НаименованиеМесяца = "";
	МассивВариантовСклонения = ПолучитьСклоненияСтроки(Формат(СтандартныйПериодОтбора.ДатаОкончания, "ДФ=MMM"), "ПЛ=Мужской", "ПД=Родительный");
	Если МассивВариантовСклонения.Количество() > 0 Тогда 
		НаименованиеМесяца = МассивВариантовСклонения[0];	
	КонецЕсли;
	ПредставлениеДатыОкончания = ПредставлениеДатыОкончания + ?(ЗначениеЗаполнено(НаименованиеМесяца), " " + НаименованиеМесяца, "");
	
	ПредставлениеВарианта = ПредставлениеВарианта + " (" + ПредставлениеДатыНачала + " - " + ПредставлениеДатыОкончания + ")";
	
	Возврат ПредставлениеВарианта;
	
КонецФункции

#КонецОбласти

#КонецЕсли
